In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.3'

In [3]:
data = pd.read_csv('melb_data.csv')

In [4]:
data

,Unnamed: 0,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.79960,144.99840,Northern Metropolitan,4019.0
1,2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.80790,144.99340,Northern Metropolitan,4019.0
2,4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.80930,144.99440,Northern Metropolitan,4019.0
3,5,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.79690,144.99690,Northern Metropolitan,4019.0
4,6,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.80720,144.99410,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18391,23540,Williamstown,8/2 Thompson St,2,t,622500.0,SP,Greg,26/08/2017,6.8,...,2.0,1.0,NaN,89.0,2010.0,NaN,-37.86393,144.90484,Western Metropolitan,6380.0
18392,23541,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0
18393,23544,Yallambie,17 Amaroo Wy,4,h,1100000.0,S,Buckingham,26/08/2017,12.7,...,3.0,2.0,NaN,NaN,NaN,NaN,-37.72006,145.10547,Northern Metropolitan,1369.0
18394,23545,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,...,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0
18395,23546,Yarraville,33 Freeman St,4,h,1050000.0,VB,Village,26/08/2017,6.3,...,2.0,2.0,NaN,139.0,1950.0,NaN,-37.81829,144.87404,Western Metropolitan,6543.0

In [5]:
animals = ['Tiger', 'Bear', 'Moose']
p_animals = pd.Series(animals)
p_animals

0    Tiger
1     Bear
2    Moose
dtype: object

In [ ]:
type(p_animals)

pandas.core.series.Series

In [7]:
p_animals[2]

'Moose'

In [8]:
animals =['Tiger', 'Bear', None]
p_animals = pd.Series(animals)
p_animals

0    Tiger
1     Bear
2     None
dtype: object

In [9]:
animals = [2.0, 20, 1.5]
p_animals = pd.Series(animals)
p_animals

0     2.0
1    20.0
2     1.5
dtype: float64

In [10]:
animals = [2.0, 20.1, None]
p_animals = pd.Series(animals)
p_animals

0     2.0
1    20.1
2     NaN
dtype: float64

In [11]:
animals = {
    'n1' : 'Tiger',
    'n2' : 'Bear',
    'n3' : None
}
p_animals = pd.Series(animals)
p_animals

n1    Tiger
n2     Bear
n3     None
dtype: object

In [12]:
print(p_animals.iloc[2])

None

In [13]:
type(p_animals)

pandas.core.series.Series

In [14]:
p_animals.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [15]:
p_animals.values

array(['Tiger', 'Bear', None], dtype=object)

In [16]:
p_animals = pd.Series(['Tiger', 'Bear', 'Moose'], index=['n1', 'n2', 'n3'])
p_animals

n1    Tiger
n2     Bear
n3    Moose
dtype: object

In [17]:
p_animals['n1']

'Tiger'

In [18]:
p_animals.loc['n1']

'Tiger'

In [19]:
for item in p_animals:
    print('Salam' + str(item))

SalamTiger
SalamBear
SalamMoose

In [22]:
animals = [2.0, 20.1, 'Amir']
p_animals = pd.Series(animals)
p_animals

0     2.0
1    20.1
2    Amir
dtype: object

In [25]:
animals = {
    'n1' : 'Tiger',
    'n2' : 'Bear',
    'n3' : 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1' : 'Tiger2',
    'n2' : 'Bear2',
    'n3' : 'Moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1' : 'Tiger3',
    'n2' : 'Bear3',
    'n3' : 'Moose3'
}
p_animals3 = pd.Series(animals)

df = pd.DataFrame([p_animals, p_animals2, p_animals3], index=['r1', 'r2', 'r3'])
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [26]:
df.loc['r2']

n1    Tiger2
n2     Bear2
n3    Moose2
Name: r2, dtype: object

In [27]:
df.loc['r2', 'n2']

'Bear2'

In [28]:
df.T

       r1      r2      r3
n1  Tiger  Tiger2  Tiger3
n2   Bear   Bear2   Bear3
n3  Moose  Moose2  Moose3

In [29]:
df.loc[:, ['n2', 'n3']]

       n2      n3
r1   Bear   Moose
r2  Bear2  Moose2
r3  Bear3  Moose3

In [30]:
df.drop('r1', inplace=True)

In [31]:
df

        n1     n2      n3
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3

In [32]:
animals = {
    'n1' : 'Tiger',
    'n2' : 'Bear',
    'n3' : 'Moose'
}
p_animals = pd.Series(animals)
animals = {
    'n1' : 'Tiger2',
    'n2' : 'Bear2',
    'n3' : 'Moose2'
}
p_animals2 = pd.Series(animals)
animals = {
    'n1' : 'Tiger3',
    'n2' : 'Bear3',
    'n3' : 'Moose3'
}
p_animals3 = pd.Series(animals)

df = pd.DataFrame([p_animals, p_animals2, p_animals3], index=['r1', 'r2', 'r3'])
df

        n1     n2      n3
r1   Tiger   Bear   Moose
r2  Tiger2  Bear2  Moose2
r3  Tiger3  Bear3  Moose3